robbie-cao/nuc505/SampleCode/StdDriver/USBD_Audio_Microphone/main.c
/**************************************************************************//**
 * @file     main.c
 * @version  V5.2
 * $Revision: 10 $
 * $Date: 15/09/30 08:23 p.m. $ 
 * @brief    NUC505 Series Global Control and Clock Control Driver Sample Code
 *					
 * 1.	Demonstrate delay function by systick.
 * 2.	Demonstrate core clock switching.
 * 3.	Demonstrate how to enable module clock and set module clock divider.
 *
 * @note
 * Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
 *
 ******************************************************************************/
#include <stdio.h>
#include <string.h>
#include "NUC505Series.h"
#include "usbd_audio.h"

#ifdef __HID__
#include "Keypad.h"
#ifdef __ICCARM__
#pragma data_alignment=4
	uint8_t buf[8];
#else
__align(4) uint8_t buf[8];
#endif
void HID_UpdateKbData(void);
extern uint8_t volatile g_u8EPCReady;
#endif

//int32_t g_volume_flag;
void InternalCODEC_Setup(int8_t i8RecVol);
extern uint32_t g_ubsd_tx_flag;

extern volatile uint8_t bRecVolumeAdjust;
extern volatile uint8_t bSampleRateAdjust;
extern volatile uint8_t bRecMuteAdjust;

extern volatile uint32_t g_usbd_SampleRate;
extern volatile uint32_t g_usbd_SampleBitRate;
extern uint8_t  g_usbd_RecMute;
extern int16_t  g_usbd_RecVolume;

/* FIXME */
extern volatile uint32_t g_u32Temp1;
extern volatile uint32_t g_u32Temp2;

/* FIXME */
uint32_t g_u32Temp3;
uint32_t g_u32Temp4;
//uint32_t g_u32Temp5;
uint32_t g_u32Temp6;
uint32_t g_u32Temp7;
uint32_t g_u32Temp8;
uint32_t g_u32Temp9;

/* FIXME */
volatile uint32_t g_u32DecreaseAPLL;
volatile uint32_t g_u32CurrentAPLL;
volatile uint32_t g_u32IncreaseAPLL;
volatile uint32_t g_u32RefAPLL;

#ifdef __HID__
static volatile uint32_t s_u32TimeOutCounter;

#define EVB_VKEYC00BIT       (0x0001)		/* GPIO C0 */
#define EVB_VKEYC01BIT       (0x0002)		/* GPIO C1 */
#define EVB_VKEYC02BIT       (0x0004)		/* GPIO C2 */
#define EVB_VKEYC03BIT       (0x0008)		/* GPIO C3 */
#define EVB_VKEYC04BIT       (0x0010)		/* GPIO C4 */

/*
   GPIO KEY has three states, falling, pressiong, and releasing.

   postfix _F means falling
   postfix _P means pressing
   postfix _R means releasing
*/
#define APP_KEYPAD_C00_F         (0x00)
#define APP_KEYPAD_C00_P         (0x01)
#define APP_KEYPAD_C00_R         (0x02)
#define APP_KEYPAD_C01_F         (0x10)
#define APP_KEYPAD_C01_P         (0x11)
#define APP_KEYPAD_C01_R         (0x12)
#define APP_KEYPAD_C02_F         (0x20)
#define APP_KEYPAD_C02_P         (0x21)
#define APP_KEYPAD_C02_R         (0x22)
#define APP_KEYPAD_C03_F         (0x30)
#define APP_KEYPAD_C03_P         (0x31)
#define APP_KEYPAD_C03_R         (0x32)
#define APP_KEYPAD_C04_F         (0x40)
#define APP_KEYPAD_C04_P         (0x41)
#define APP_KEYPAD_C04_R         (0x42)

void
App_KeypadEventHandler(
	uint32_t u32Param
)
{
#ifdef __KEYBOARD__	
	switch (u32Param) {	
	case APP_KEYPAD_C00_F:		/* falling */
//		printf("C00_F\n");
		break;
	case APP_KEYPAD_C00_P:		/* pressing */
//		printf("C00_P\n");
		break;
	case APP_KEYPAD_C00_R:		/* releasing */
		buf[2] = 0x04;	/* Key A */
//		printf("C00_R\n");
		break;
	case APP_KEYPAD_C01_F:		/* falling */
//		printf("C01_F\n");
		break;
	case APP_KEYPAD_C01_P:		/* pressing */
//		printf("C01_P\n");
		break;
	case APP_KEYPAD_C01_R:		/* releasing */
		buf[2] = 0x05;	/* Key B */
//		printf("C01_R\n");
		break;
	case APP_KEYPAD_C02_F:		/* falling */
//		printf("C02_F\n");
		break;
	case APP_KEYPAD_C02_P:		/* pressing */
//		printf("C02_P\n");
		break;
	case APP_KEYPAD_C02_R:		/* releasing */
		buf[2] = 0x06;	/* Key C */
//		printf("C02_R\n");
		break;
	case APP_KEYPAD_C03_F:		/* falling */
//		printf("C03_F\n");
		break;
	case APP_KEYPAD_C03_P:		/* pressing */
//		printf("C03_P\n");
		break;
	case APP_KEYPAD_C03_R:		/* releasing */
		buf[2] = 0x07;	/* Key D */
//		printf("C03_R\n");
		break;
	case APP_KEYPAD_C04_F:		/* falling */
//		printf("C04_F\n");
		break;
	case APP_KEYPAD_C04_P:		/* pressing */
//		printf("C04_P\n");
		break;
	case APP_KEYPAD_C04_R:		/* releasing */
		buf[2] = 0x08;	/* Key E */
//		printf("C04_R\n");
		break;
	default:
		break;
	}
#elif defined __MEDIAKEY__
	buf[0] = 0;
	buf[1] = 0;
	switch (u32Param) {
	case APP_KEYPAD_C00_F:		/* falling */
//		printf("C00_F\n");
		break;
	case APP_KEYPAD_C00_P:		/* pressing */
//		printf("C00_P\n");
		break;
	case APP_KEYPAD_C00_R:		/* releasing */
		buf[1] |= HID_CTRL_PAUSE;	/* play/pause */
//		printf("C00_R\n");
		break;
	case APP_KEYPAD_C01_F:		/* falling */
//		printf("C01_F\n");
		break;
	case APP_KEYPAD_C01_P:		/* pressing */
//		printf("C01_P\n");
		break;
	case APP_KEYPAD_C01_R:		/* releasing */
		buf[1] |= HID_CTRL_NEXT;	/* Next */
//		printf("C01_R\n");
		break;
	case APP_KEYPAD_C02_F:		/* falling */
//		printf("C02_F\n");
		break;
	case APP_KEYPAD_C02_P:		/* pressing */
//		printf("C02_P\n");
		break;
	case APP_KEYPAD_C02_R:		/* releasing */
		buf[1] |= HID_CTRL_PREVIOUS;	/* Previous */
//		printf("C02_R\n");
		break;
	case APP_KEYPAD_C03_F:		/* falling */
//		printf("C03_F\n");
		break;
	case APP_KEYPAD_C03_P:		/* pressing */
		buf[0] |= HID_CTRL_VOLUME_INC;
//		printf("C03_P\n");
		break;
	case APP_KEYPAD_C03_R:		/* releasing */
		buf[0] |= HID_CTRL_VOLUME_INC;	/* Vol+ */
//		printf("C03_R\n");
		break;
	case APP_KEYPAD_C04_F:		/* falling */
//		printf("C04_F\n");
		break;
	case APP_KEYPAD_C04_P:		/* pressing */
		buf[0] |= HID_CTRL_VOLUME_DEC;
//		printf("C04_P\n");
		break;
	case APP_KEYPAD_C04_R:		/* releasing */
		buf[0] |= HID_CTRL_VOLUME_DEC;	/* Vol- */
//		printf("C04_R\n");
		break;
	default:
		break;
	}
#endif
}

static const S_KEYPAD_TGR_HANDLER g_asKeypadTgrHandler[] = {
	{App_KeypadEventHandler, APP_KEYPAD_C00_F,           EVB_VKEYC00BIT, KEYPAD_GPIOC, KEYPAD_FALLING},
	{App_KeypadEventHandler, APP_KEYPAD_C00_P,           EVB_VKEYC00BIT, KEYPAD_GPIOC, KEYPAD_PRESSING},
	{App_KeypadEventHandler, APP_KEYPAD_C00_R,           EVB_VKEYC00BIT, KEYPAD_GPIOC, KEYPAD_RISING},
	{App_KeypadEventHandler, APP_KEYPAD_C01_F,           EVB_VKEYC01BIT, KEYPAD_GPIOC, KEYPAD_FALLING},
	{App_KeypadEventHandler, APP_KEYPAD_C01_P,           EVB_VKEYC01BIT, KEYPAD_GPIOC, KEYPAD_PRESSING},
	{App_KeypadEventHandler, APP_KEYPAD_C01_R,           EVB_VKEYC01BIT, KEYPAD_GPIOC, KEYPAD_RISING},
	{App_KeypadEventHandler, APP_KEYPAD_C02_F,           EVB_VKEYC02BIT, KEYPAD_GPIOC, KEYPAD_FALLING},
	{App_KeypadEventHandler, APP_KEYPAD_C02_P,           EVB_VKEYC02BIT, KEYPAD_GPIOC, KEYPAD_PRESSING},
	{App_KeypadEventHandler, APP_KEYPAD_C02_R,           EVB_VKEYC02BIT, KEYPAD_GPIOC, KEYPAD_RISING},
	{App_KeypadEventHandler, APP_KEYPAD_C03_F,           EVB_VKEYC03BIT, KEYPAD_GPIOC, KEYPAD_FALLING},
	{App_KeypadEventHandler, APP_KEYPAD_C03_P,           EVB_VKEYC03BIT, KEYPAD_GPIOC, KEYPAD_PRESSING},
	{App_KeypadEventHandler, APP_KEYPAD_C03_R,           EVB_VKEYC03BIT, KEYPAD_GPIOC, KEYPAD_RISING},
	{App_KeypadEventHandler, APP_KEYPAD_C04_F,           EVB_VKEYC04BIT, KEYPAD_GPIOC, KEYPAD_FALLING},
	{App_KeypadEventHandler, APP_KEYPAD_C04_P,           EVB_VKEYC04BIT, KEYPAD_GPIOC, KEYPAD_PRESSING},
	{App_KeypadEventHandler, APP_KEYPAD_C04_R,           EVB_VKEYC04BIT, KEYPAD_GPIOC, KEYPAD_RISING},

	{0,0,0,0,0}         // ended by all zero
};

void TMR0_IRQHandler(void)
{
	// clear timer interrupt flag
	TIMER_ClearIntFlag(TIMER0);

	s_u32TimeOutCounter++;
	Keypad_TgrDecDebounceCounter();

	/* To avoid the synchronization issue between system and APB clock domain */
	TIMER_GetIntFlag(TIMER0);
}

void KEY_Init(void)
{
	/* Enable IP clock */
  CLK_EnableModuleClock(TMR0_MODULE);

