robbie-cao/nuc505/SampleCode/StdDriver/USBD_Audio_Microphone/main.c
  /* Select IP clock source */
  CLK_SetModuleClock(TMR0_MODULE, CLK_TMR0_SRC_EXT, 0);

	SYS->GPC_MFPL  = (SYS->GPC_MFPL & (~SYS_GPC_MFPL_PC0MFP_Msk) );
	SYS->GPC_MFPL  = (SYS->GPC_MFPL & (~SYS_GPC_MFPL_PC1MFP_Msk) );
	SYS->GPC_MFPL  = (SYS->GPC_MFPL & (~SYS_GPC_MFPL_PC2MFP_Msk) );
	SYS->GPC_MFPL  = (SYS->GPC_MFPL & (~SYS_GPC_MFPL_PC3MFP_Msk) );
	SYS->GPC_MFPL  = (SYS->GPC_MFPL & (~SYS_GPC_MFPL_PC4MFP_Msk) );
	
	GPIO_SetMode(PC, (BIT4 |BIT3 |BIT2 |BIT1 |BIT0), GPIO_MODE_INPUT);
  GPIO_SetPullMode(PC, (BIT4 |BIT3 |BIT2 |BIT1 |BIT0), GPIO_PULL_UP_EN);
	
	// Debounce 8 time unit, pressing event interval 80 time unit
  Keypad_InitKeypad(8,40);
	
	Keypad_InitTgr(
        NULL,
        NULL,
				(EVB_VKEYC04BIT |EVB_VKEYC03BIT |EVB_VKEYC02BIT |EVB_VKEYC01BIT |EVB_VKEYC00BIT),
        g_asKeypadTgrHandler);

  // Set timer frequency
  TIMER_Open(TIMER0, TIMER_PERIODIC_MODE, 100);

  // Enable timer interrupt
  TIMER_EnableInt(TIMER0);
  NVIC_EnableIRQ(TMR0_IRQn);

  // Start Timer 0
  TIMER_Start(TIMER0);
}
#endif

void SYS_Init(void)
{
/*---------------------------------------------------------------------------------------------------------*/
/* Init System Clock                                                                                       */
/*---------------------------------------------------------------------------------------------------------*/   
    /* Enable  XTAL */
    CLK->PWRCTL |= CLK_PWRCTL_HXTEN_Msk;        

		/* Configure System Core Clock */
		CLK_SetCoreClock(FREQ_96MHZ);
	
    /* Set PCLK divider */
    CLK_SetModuleClock(PCLK_MODULE, NULL, 1);
	
    /* Update System Core Clock */
    SystemCoreClockUpdate();
    
      /* Enable USB IP clock */
    CLK_EnableModuleClock(USBD_MODULE);

    /* Select USB IP clock source */
    CLK_SetModuleClock(USBD_MODULE, CLK_USBD_SRC_EXT, 0);          
}

void I2S_Init(uint32_t u32SR, uint32_t u32SBR)
{
	uint32_t u32Temp1 = 0, u32Temp2 = 0, u32Temp3;
	
		/* Enable I2S Module clock */
    CLK_EnableModuleClock(I2S_MODULE);
		/* I2S module clock from APLL */

	if ( u32SR % 11025 )
	{
		// APLL = 49152031Hz
		CLK_SET_APLL(CLK_APLL_49152031);
		
		if ( u32SR == 8000 )
			// I2S = 49152031Hz / (1+1) for 8k sampling rate
			CLK_SetModuleClock(I2S_MODULE, CLK_I2S_SRC_APLL, 1);
		else
			// I2S = 49152031Hz / (0+1) for 12k, 16k, 24k, 32k, 48k, and 96k sampling rate
			CLK_SetModuleClock(I2S_MODULE, CLK_I2S_SRC_APLL, 0);

	g_u32DecreaseAPLL = CLK_APLL_49142857;
	g_u32CurrentAPLL = CLK_APLL_49152031;
	g_u32IncreaseAPLL = 0x844D542;
	g_u32RefAPLL = g_u32CurrentAPLL;
	
	/* FIXME */
	if ( u32SBR == 16 )
	{
	/* for 8000, 16000, 32000, 24000, 48000, and 96000 2 channels 16-bit */
	u32Temp1 = 3840; /* 3840 bytes = 96000 Hz * 2 channels * 2 bytes / 1000 ms * 10 ms */
	u32Temp2 = u32SR * 2 * 2 / 1000;
	}
	else
	{
		printf( "Error! Bit rate not supported %d\n", u32SBR );
	}
	g_u32Temp3 = u32Temp1 / u32Temp2;
	g_u32Temp3--;

	/* FIXME */
	g_u32Temp1 = u32Temp2;
	g_u32Temp2 = u32Temp2;
	
	}
	else
	{
		// APLL = 45158425Hz
		CLK_SET_APLL(CLK_APLL_45158425);
		
		// I2S = 45158425Hz / (0+1) for 11025k, 22050k, and 44100k sampling rate
		CLK_SetModuleClock(I2S_MODULE, CLK_I2S_SRC_APLL, 0);
	
		g_u32DecreaseAPLL = CLK_APLL_45142857;
		g_u32CurrentAPLL = CLK_APLL_45158425;
		g_u32IncreaseAPLL = 0xE04D382;
		g_u32RefAPLL = g_u32CurrentAPLL;
		
		/* FIXME */
		if ( u32SBR == 16 )
		{
		/* for 11025, 22050 and 44100 2 channels 16-bit */
		u32Temp1 = 1764; /* 1764 bytes = 44100 Hz * 2 channels * 2 bytes / 1000 ms * 10 ms */
		u32Temp2 = u32SR * 2 * 2 / 1000;
		}
		else
		{
			printf( "Error! Bit rate not supported %d\n", u32SBR );
		}
		g_u32Temp3 = u32Temp1 / u32Temp2;
		u32Temp3 = u32Temp2 * g_u32Temp3;
		u32Temp3 = (u32Temp1 - u32Temp3) + u32Temp2;
		g_u32Temp3--;

		/* FIXME */
		g_u32Temp1 = u32Temp2;
		g_u32Temp2 = u32Temp3;
	}

	/* FIXME TX start condition */
	if ( u32SBR == 16 )
	{
	g_u32Temp4 = (u32Temp2 * 3) / 2; /* (3ms, byte size) / 2 = sample count */
	}
	else
	{
		printf( "Error! Bit rate not supported %d\n", u32SBR );
	}

	/* FIXME TX noise detect and try to fix condition */
	g_u32Temp6 = g_u32Temp1 * 2;
	g_u32Temp7 = RING_BUF_SMPL_SZ - g_u32Temp6;

	/* FIXME RX start condition */
	g_u32Temp8 = g_u32Temp1 * 5;
	
	/* FIXME RX noise detect */
	g_u32Temp9 = RING_BUF_SMPL_SZ - g_u32Temp1;

    /* Reset IP */
    SYS_ResetModule(I2S_RST);    
    /*---------------------------------------------------------------------------------------------------------*/
    /* Init I/O Multi-function                                                                                 */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Configure multi-function pins for SPI0 */
		// GPC[8]  = MCLK
		// GPC[9]  = DIN
		// GPC[10] = DOUT
		// GPC[11] = LRCLK
		// GPC[12] = BCLK
//		SYS->GPC_MFPH  = (SYS->GPC_MFPH & (~SYS_GPC_MFPH_PC8MFP_Msk) ) | SYS_GPC_MFPH_PC8MFP_I2S_MCLK;	
//		SYS->GPC_MFPH  = (SYS->GPC_MFPH & (~SYS_GPC_MFPH_PC9MFP_Msk) ) | SYS_GPC_MFPH_PC9MFP_I2S_DIN;	
//		SYS->GPC_MFPH  = (SYS->GPC_MFPH & (~SYS_GPC_MFPH_PC10MFP_Msk) ) | SYS_GPC_MFPH_PC10MFP_I2S_DOUT;	
//		SYS->GPC_MFPH  = (SYS->GPC_MFPH & (~SYS_GPC_MFPH_PC11MFP_Msk) ) | SYS_GPC_MFPH_PC11MFP_I2S_LRCLK;	
//		SYS->GPC_MFPH  = (SYS->GPC_MFPH & (~SYS_GPC_MFPH_PC12MFP_Msk) ) | SYS_GPC_MFPH_PC12MFP_I2S_BCLK;	
	
}

void UART0_Init(void)
{
		/* Enable UART1 Module clock */
    CLK_EnableModuleClock(UART0_MODULE);
	
		/* UART1 module clock from EXT */
		CLK_SetModuleClock(UART0_MODULE, CLK_UART0_SRC_EXT, 0);
	
    /* Reset IP */
    SYS_ResetModule(UART0_RST);    
	
    /* Configure UART0 and set UART0 Baudrate */
		UART_Open(UART0, 115200);
	
		/*---------------------------------------------------------------------------------------------------------*/
    /* Init I/O Multi-function                                                                                 */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Configure multi-function pins for UART0 RXD and TXD */
		SYS->GPB_MFPL  = (SYS->GPB_MFPL & (~SYS_GPB_MFPL_PB0MFP_Msk) ) | SYS_GPB_MFPL_PB0MFP_UART0_TXD;	
		SYS->GPB_MFPL  = (SYS->GPB_MFPL & (~SYS_GPB_MFPL_PB1MFP_Msk) ) | SYS_GPB_MFPL_PB1MFP_UART0_RXD;	
	
