robbie-cao/nuc505/SampleCode/StdDriver/USBD_Audio_Microphone/main.c
}

void UART1_Init(void)
{
		/* Enable UART1 Module clock */
    CLK_EnableModuleClock(UART1_MODULE);
	
		/* UART1 module clock from EXT */
		CLK_SetModuleClock(UART1_MODULE, CLK_UART1_SRC_EXT, 0);
	
    /* Reset IP */
    SYS_ResetModule(UART1_RST);    
	
    /* Configure UART1 and set UART1 Baudrate */
		UART_Open(UART1, 115200);
	
		/*---------------------------------------------------------------------------------------------------------*/
    /* Init I/O Multi-function                                                                                 */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Configure multi-function pins for UART1 RXD and TXD */
		SYS->GPA_MFPH  = (SYS->GPA_MFPH & (~SYS_GPA_MFPH_PA8MFP_Msk) ) | SYS_GPA_MFPH_PA8MFP_UART1_TXD;	
		SYS->GPA_MFPH  = (SYS->GPA_MFPH & (~SYS_GPA_MFPH_PA9MFP_Msk) ) | SYS_GPA_MFPH_PA9MFP_UART1_RXD;	
	
}

volatile uint32_t g_usbd_pollingclassrequest = 0;
volatile uint32_t g_usbd_pollingsetinterface = 0;
volatile uint32_t g_usbd_pollingsetinterfacealtinterface = 0;

void UAC_ClassRequest2(void)
{
	if ( g_usbd_pollingclassrequest == 0 )
		g_usbd_pollingclassrequest = 1;
}

void UAC_SetInterface2(uint32_t u32AltInterface)
{
	if ( g_usbd_pollingsetinterface == 0 )
	{
		g_usbd_pollingsetinterface = 1;
		g_usbd_pollingsetinterfacealtinterface = u32AltInterface;
	}
}

int main(void)
 {
		uint32_t u32CurSR, u32CurSBR;

    /* Init System, IP clock and multi-function I/O */
    SYS_Init();
	
    /* Init UART to 115200-8n1 for print message */
    UART0_Init();   
//    UART1_Init();

    printf("NUC505 USB UAC - Microphone");
#ifdef __HID__
		printf(" + HID");
#ifdef __KEYBOARD__
		printf(" - Keyboard");
#elif defined __MEDIAKEY__	
		printf(" - Mediakey");
#endif
#endif	
		printf("\n");

#if defined (__ICCARM__)
        #pragma section = "VECTOR2"              
        
				extern uint32_t __Vectors[];
				extern uint32_t __Vectors_Size[];	
             
				//printf("Relocate vector table in SRAM (0x%08X) for fast interrupt handling.\n", __section_begin("VECTOR2"));
				memcpy((void *) __section_begin("VECTOR2"), (void *) __Vectors, (unsigned int) __Vectors_Size);
				SCB->VTOR = (uint32_t) __section_begin("VECTOR2");
        
#else 
	/* Relocate vector table in SRAM for fast interrupt handling. */
    {
        extern uint32_t __Vectors[];
        extern uint32_t __Vectors_Size[];
        extern uint32_t Image$$ER_VECTOR2$$ZI$$Base[];
    
//        printf("Relocate vector table in SRAM (0x%08X) for fast interrupt handling.\n", Image$$ER_VECTOR2$$ZI$$Base);
        memcpy((void *) Image$$ER_VECTOR2$$ZI$$Base, (void *) __Vectors, (unsigned int) __Vectors_Size);
        SCB->VTOR = (uint32_t) Image$$ER_VECTOR2$$ZI$$Base;
    }
#endif 		

		/* Init I2S, IP clock and multi-function I/O */
		I2S_Init(REC_DEF_RATE, REC_BIT_RATE);
		
#ifdef __HID__
	/* Init KEY */
	KEY_Init();
#endif

		/* FIXME: support stereo and 16-bit only for now */
		if ( REC_BIT_RATE == 16 )
		I2S_Open(I2S, I2S_MODE_MASTER, REC_DEF_RATE, I2S_DATABIT_16, I2S_STEREO, I2S_FORMAT_I2S, I2S_ENABLE_INTERNAL_CODEC);
		else
			printf( "Error! Bit rate not supported %d\n", REC_BIT_RATE );
	u32CurSR = REC_DEF_RATE;
		u32CurSBR = REC_BIT_RATE;
		I2S_EnableMCLK(I2S, REC_DEF_RATE*256);
		
		I2S_SET_RX_TH_LEVEL(I2S, I2S_FIFO_RX_LEVEL_WORD_8);
		
		InternalCODEC_Setup(g_usbd_RecVolume);
//	printf("1 %d %d %d\n", u32CurSR, g_usbd_SampleRate, bSampleRateAdjust);
	DMA_Init();

	/* Enable I2S Rx function */
	I2S_ENABLE_RX(I2S);
  I2S_ENABLE_RXDMA(I2S);

    USBD_Open(&gsInfo, UAC_ClassRequest2, UAC_SetInterface2);
		
    /* Endpoint configuration */
    UAC_Init();
    NVIC_EnableIRQ(USBD_IRQn);
    USBD_Start();
    while(1)
		{
				if(g_ubsd_tx_flag&& (USBD->EP[EPB].EPDATCNT == 0))
				{
						EPA_Handler();
						g_ubsd_tx_flag = 0;
				}
				
				if (USBD_IS_ATTACHED()) {
						/* USB Plug In */
						USBD_ENABLE_USB();
				} else {
						g_ubsd_tx_flag = 0;
//					printf("da\n");
				}			

		if (bSampleRateAdjust)
		{
			bSampleRateAdjust = FALSE;
			printf("2a %d %d %d %d %d\n", u32CurSR, g_usbd_SampleRate, bSampleRateAdjust, u32CurSBR, g_usbd_SampleBitRate);
			if ( (u32CurSR != g_usbd_SampleRate) || (u32CurSBR != g_usbd_SampleBitRate))
			{
//				printf("2b %d %d %d %d %d\n", u32CurSR, g_usbd_SampleRate, bSampleRateAdjust, u32CurSBR, g_usbd_SampleBitRate);
				u32CurSR = g_usbd_SampleRate;
				u32CurSBR = g_usbd_SampleBitRate;
				printf("2c %d %d %d %d %d\n", u32CurSR, g_usbd_SampleRate, bSampleRateAdjust, u32CurSBR, g_usbd_SampleBitRate);
				/* Init I2S, IP clock and multi-function I/O */
				I2S_Init(g_usbd_SampleRate, g_usbd_SampleBitRate);

				/* FIXME: support stereo and 16-bit only for now */
				if ( g_usbd_SampleBitRate == 16 )
				I2S_Open(I2S, I2S_MODE_MASTER, g_usbd_SampleRate, I2S_DATABIT_16, I2S_STEREO, I2S_FORMAT_I2S, I2S_ENABLE_INTERNAL_CODEC);
				else
					printf( "Error! Bit rate not supported %d\n", g_usbd_SampleBitRate );
				I2S_EnableMCLK(I2S, g_usbd_SampleRate*256);
				
				I2S_SET_RX_TH_LEVEL(I2S, I2S_FIFO_RX_LEVEL_WORD_8);

				/* FIXME: need to ramp up or ramp down to avoid pop-noise */
				InternalCODEC_Setup(g_usbd_RecVolume);
//				printf("2 %d %d %d\n", u32CurSR, g_usbd_SampleRate, bSampleRateAdjust);
				DMA_Init();

				/* Enable I2S Rx function */
				I2S_ENABLE_RX(I2S);
				I2S_ENABLE_RXDMA(I2S);
			}
		}

#ifdef __HID__				
				HID_UpdateKbData();
#endif							
			if ( g_usbd_pollingclassrequest == 1 )
			{
//							if(g_volume_flag != 0)
//							{
									UAC_ClassRequest();
									g_usbd_pollingclassrequest = 0;
//							}
			}

			if ( g_usbd_pollingsetinterface == 1 )
			{
				UAC_SetInterface( g_usbd_pollingsetinterfacealtinterface );
				g_usbd_pollingsetinterface = 0;
			}
		}
}

#ifdef __HID__	
void HID_UpdateKbData(void)
{
#if 0
    uint32_t key = 0xF;
    static uint32_t preKey;
#endif
    int32_t n;
		int32_t volatile i;
    n = 8;
    if(g_u8EPCReady)
    {
				if(USBD->EP[EPC].EPDATCNT)
				{
								USBD->EP[EPC].EPRSPCTL = USB_EP_RSPCTL_SHORTTXEN;	
					g_u8EPCReady = 0;
					return;
					
