robbie-cao/nuc505/SampleCode/StdDriver/USBD_Audio_Microphone/main.c
				}
#ifdef __KEYBOARD__			
#if 0
        // PC0_PIN, A
        // PC1_PIN, B
        // PC2_PIN, C
        // PC3_PIN, D
				// PC4_PIN, E
        key = !PC0_PIN | (!PC1_PIN << 1) | (!PC2_PIN << 1) | (!PC3_PIN << 1) | (!PC4_PIN << 1);

        if(key == 0)
        {
            for(i = 0; i < n; i++)
                buf[i] = 0;

            if(key != preKey)
            {
                preKey = key;
                g_u8EPCReady = 0;
                /* Trigger to note key release */
								/* Set transfer length and trigger IN transfer */
					
								while(1) 
								{
										if (!(USBD->DMACTL & USBD_DMACTL_DMAEN_Msk))
												break;

										if (!USBD_IS_ATTACHED())
												break;
								}
								USBD_SET_DMA_READ(HID_IN_EP_NUM);
								USBD_SET_DMA_ADDR((uint32_t)&buf[0]);
								USBD_SET_DMA_LEN(8);
								USBD_ENABLE_DMA();	
								while(1) 
								{
										if (!(USBD->DMACTL & USBD_DMACTL_DMAEN_Msk))
												break;

										if (!USBD_IS_ATTACHED())
												break;
								}		
            }				
        }
        else
        {
            preKey = key;   
						if(!PC0_PIN)
                buf[2] = 0x04;	/* Key A */
            else if(!PC1_PIN)
                buf[2] = 0x05;	/* Key B */
            else if(!PC2_PIN)
                buf[2] = 0x06;	/* Key C */	
						else if(!PC3_PIN)
                buf[2] = 0x07;	/* Key D */
            else if(!PC4_PIN)
                buf[2] = 0x08;	/* Key E */			
						else if(!PC5_PIN)
                buf[2] = 0x09;	/* Key F */

            g_u8EPCReady = 0;
						/* Set transfer length and trigger IN transfer */	
						while(1) 
						{
								if (!(USBD->DMACTL & USBD_DMACTL_DMAEN_Msk))
										break;

								if (!USBD_IS_ATTACHED())
										break;
						}
						USBD_SET_DMA_READ(HID_IN_EP_NUM);
						USBD_SET_DMA_ADDR((uint32_t)&buf[0]);
						USBD_SET_DMA_LEN(8);
						USBD_ENABLE_DMA();	
						while(1) 
						{
								if (!(USBD->DMACTL & USBD_DMACTL_DMAEN_Msk))
										break;

								if (!USBD_IS_ATTACHED())
										break;
						}			
				}
#else
for(i = 0; i < n; i++)
	buf[i] = 0;
g_u8EPCReady = 0;
Keypad_ScanTgr();			/* GPIO KEY scan */
/* Set transfer length and trigger IN transfer */	
while (1)
{
	if (!(USBD->DMACTL & USBD_DMACTL_DMAEN_Msk))
		break;

	if (!USBD_IS_ATTACHED())
		break;
}
USBD_SET_DMA_READ(HID_IN_EP_NUM);
USBD_SET_DMA_ADDR((uint32_t)&buf[0]);
USBD_SET_DMA_LEN(8);
USBD_ENABLE_DMA();
while (1)
{
	if (!(USBD->DMACTL & USBD_DMACTL_DMAEN_Msk))
		break;

	if (!USBD_IS_ATTACHED())
		break;
}
#endif
#elif defined __MEDIAKEY__	
#if 0

        // PC0_PIN, play/pause
        // PC1_PIN, Next
        // PC2_PIN, Previous
        // PC3_PIN, Vol+
        // PC4_PIN, Vol-
        key = !PC0_PIN | (!PC1_PIN << 1) | (!PC2_PIN << 1) | (!PC3_PIN << 1) | (!PC4_PIN << 1);

        if(key == 0)
        {
            for(i = 0; i < n; i++)
                buf[i] = 0;

            if(key != preKey)
            {
                preKey = key;
                g_u8EPCReady = 0;
                /* Trigger to note key release */
								/* Set transfer length and trigger IN transfer */
								while(1) 
								{
										if (!(USBD->DMACTL & USBD_DMACTL_DMAEN_Msk))
												break;

										if (!USBD_IS_ATTACHED())
												break;
								}
								USBD_SET_DMA_READ(HID_IN_EP_NUM);
								USBD_SET_DMA_ADDR((uint32_t)&buf[0]);
								USBD_SET_DMA_LEN(8);
								USBD_ENABLE_DMA();	
								while(1) 
								{
										if (!(USBD->DMACTL & USBD_DMACTL_DMAEN_Msk))
												break;

										if (!USBD_IS_ATTACHED())
												break;
								}	
            }				
        }
        else
        {
            // Don't repeat key when it is media key
            if(preKey != key)
            {
                preKey = key;
                buf[0] = 0;
                buf[1] = 0;
                if(!PC0_PIN)
                    buf[1] |= HID_CTRL_PAUSE;
                else if(!PC1_PIN)
                    buf[1] |= HID_CTRL_NEXT;
                else if(!PC2_PIN)
                    buf[1] |= HID_CTRL_PREVIOUS;
                else if(!PC3_PIN)
                    buf[0] |= HID_CTRL_VOLUME_INC;
                else if(!PC4_PIN)
                    buf[0] |= HID_CTRL_VOLUME_DEC;

                g_u8EPCReady = 0;
								/* Set transfer length and trigger IN transfer */
								while(1) 
								{
										if (!(USBD->DMACTL & USBD_DMACTL_DMAEN_Msk))
												break;

										if (!USBD_IS_ATTACHED())
												break;
								}
								USBD_SET_DMA_READ(HID_IN_EP_NUM);
								USBD_SET_DMA_ADDR((uint32_t)&buf[0]);
								USBD_SET_DMA_LEN(8);
								USBD_ENABLE_DMA();	
								while(1) 
								{
										if (!(USBD->DMACTL & USBD_DMACTL_DMAEN_Msk))
												break;

										if (!USBD_IS_ATTACHED())
												break;
								}		
            }
        }
#else
for(i = 0; i < n; i++)
    buf[i] = 0;
g_u8EPCReady = 0;
Keypad_ScanTgr();
/* Set transfer length and trigger IN transfer */
while(1) 
{
		if (!(USBD->DMACTL & USBD_DMACTL_DMAEN_Msk))
				break;

		if (!USBD_IS_ATTACHED())
				break;
}
USBD_SET_DMA_READ(HID_IN_EP_NUM);
USBD_SET_DMA_ADDR((uint32_t)&buf[0]);
USBD_SET_DMA_LEN(8);
USBD_ENABLE_DMA();	
while(1) 
{
		if (!(USBD->DMACTL & USBD_DMACTL_DMAEN_Msk))
				break;

		if (!USBD_IS_ATTACHED())
				break;
}	

#endif		
#endif				
    }
}
#endif


void SysTick_Handler(void)
{
		
}

/*---------------------------------------------------------------------------------------------------------*/
/*  Internal CODEC Setting                                                                                 */
/*---------------------------------------------------------------------------------------------------------*/
void demo_LineIn(int8_t i8RecVol)
{
	uint32_t i;

		// Setting Right Line In Channel
		SYS->GPD_MFPL  = (SYS->GPD_MFPL & (~SYS_GPD_MFPL_PD4MFP_Msk) ) | SYS_GPD_MFPL_PD4MFP_RLINEIN; /* FIXME: for BSP .003 */
		/* SYS->GPD_MFPL  = (SYS->GPD_MFPL & (~SYS_GPD_MFPL_PD4MFP_Msk) ) | SYS_GPD_MFPL_PD4MFP_RIGHT_LINE_IN; FIXME: for BSP .002 */
		SYS_SetSharedPinType(SYS_PORT_D, 4, 0, 0);
	
		/* IIC Configure Step without PLL: */
		/* Add MCLK(256*Fs) in. */

		I2S_SET_INTERNAL_CODEC(I2S, 0x08, 0x1F);	// Mute headphone of Left channel
		I2S_SET_INTERNAL_CODEC(I2S, 0x09, 0x1F);	// Mute headphone of Right channel
		I2S_SET_INTERNAL_CODEC(I2S, 0x10, 0x0F);	//Mute the ADC Left channel volume
		I2S_SET_INTERNAL_CODEC(I2S, 0x11, 0x0F);	//Mute the ADC Right channel volume
		I2S_SET_INTERNAL_CODEC(I2S, 0x12, 0x0F);	//Mute the ADC Side tone volume

		I2S_SET_INTERNAL_CODEC(I2S, 0x02, 0xC0);	//Set CODEC slave

