robbie-cao/nuc505/SampleCode/StdDriver/USBD_Audio_Microphone/main.c
		I2S_SET_INTERNAL_CODEC(I2S, 0x01, 0x80);	//Digital Part Enable
		I2S_SET_INTERNAL_CODEC(I2S, 0x0F, 0xF0);	//Enable Analog Part
		I2S_SET_INTERNAL_CODEC(I2S, 0x0E, 0x00);	//ADC input select Line in

		I2S_SET_INTERNAL_CODEC(I2S, 0x0B, 0xF3);	//Analog Part Enable
		I2S_SET_INTERNAL_CODEC(I2S, 0x0D, 0x31);	//Biasing enable
		I2S_SET_INTERNAL_CODEC(I2S, 0x0B, 0xE3);
		for (i=0; i < 15; i++)	//Delay 1.5s~2.5s
			CLK_SysTickDelay(100000);
		I2S_SET_INTERNAL_CODEC(I2S, 0x0A, 0x09);
		I2S_SET_INTERNAL_CODEC(I2S, 0x0B, 0xF0);
		I2S_SET_INTERNAL_CODEC(I2S, 0x00, 0xD0);	//ADC digital enabled
		CLK_SysTickDelay(100000);	//Delay 100mS

	if (i8RecVol <= 0)
	{
		i8RecVol = 15;	// Volume Mute
	}
	else
	{
		i8RecVol--;
		if (i8RecVol > 14)	i8RecVol = 14;	// from 0 dB, 1.6 dB, 3.2 dB, ... , 22.4 dB
	}

		I2S_SET_INTERNAL_CODEC(I2S, 0x10, i8RecVol);	//Un-Mute the ADC Left channel volume
		I2S_SET_INTERNAL_CODEC(I2S, 0x11, i8RecVol);	//Un-Mute the ADC Right channel volume
//		I2S_SET_INTERNAL_CODEC(I2S, 0x12, 0x00);	//Un-Mute the ADC Side tone volume

    /* If Fs is changed, please Mute Headphone First and soft reset digital part after MCLK is stable. */
}

void demo_MIC0(int8_t i8RecVol)
{
	uint32_t i;

		/* IIC Configure Step without PLL: */
		/* Add MCLK(256*Fs) in. */

		I2S_SET_INTERNAL_CODEC(I2S, 0x08, 0x1F);	// Mute headphone of Left channel
		I2S_SET_INTERNAL_CODEC(I2S, 0x09, 0x1F);	// Mute headphone of Right channel
		I2S_SET_INTERNAL_CODEC(I2S, 0x10, 0x0F);	//Mute the ADC Left channel volume
		I2S_SET_INTERNAL_CODEC(I2S, 0x11, 0x0F);	//Mute the ADC Right channel volume
		I2S_SET_INTERNAL_CODEC(I2S, 0x12, 0x0F);	//Mute the ADC Side tone volume

		I2S_SET_INTERNAL_CODEC(I2S, 0x02, 0xC0);	//Set CODEC slave

		I2S_SET_INTERNAL_CODEC(I2S, 0x01, 0x80);	//Digital Part Enable
		I2S_SET_INTERNAL_CODEC(I2S, 0x0F, 0xC0);	//Enable Analog Part
		I2S_SET_INTERNAL_CODEC(I2S, 0x0E, 0x02);	//ADC input select MIC0

		I2S_SET_INTERNAL_CODEC(I2S, 0x0B, 0xF3);	//Analog Part Enable
		I2S_SET_INTERNAL_CODEC(I2S, 0x0D, 0x31);	//Biasing enable
		I2S_SET_INTERNAL_CODEC(I2S, 0x0B, 0xE3);
		for (i=0; i < 15; i++)	//Delay 1.5s~2.5s
			CLK_SysTickDelay(100000);
		I2S_SET_INTERNAL_CODEC(I2S, 0x0A, 0x09);
		I2S_SET_INTERNAL_CODEC(I2S, 0x0B, 0xF0);
		I2S_SET_INTERNAL_CODEC(I2S, 0x00, 0xD0);	//ADC digital enabled
		CLK_SysTickDelay(100000);	//Delay 100mS

	if (i8RecVol <= 0)
	{
		i8RecVol = 15;	// Volume Mute
		I2S_SET_INTERNAL_CODEC(I2S, 0x10, i8RecVol);	//Mute the ADC Left channel volume and set Pre-Gain 0 dB
	}
	else
	{
		i8RecVol--;
		if (i8RecVol > 14)	i8RecVol = 14;	// from 0 dB, 1.6 dB, 3.2 dB, ... , 22.4 dB
		I2S_SET_INTERNAL_CODEC(I2S, 0x10, i8RecVol|0x10);	//Un-Mute the ADC Left channel volume and set Pre-Gain 20 dB
	}

		I2S_SET_INTERNAL_CODEC(I2S, 0x11, i8RecVol);	//Un-Mute the ADC Right channel volume
//		I2S_SET_INTERNAL_CODEC(I2S, 0x12, 0x00);	//Un-Mute the ADC Side tone volume

   /* If Fs is changed, please Mute Headphone First and soft reset digital part after MCLK is stable. */
}

void demo_MIC1(int8_t i8RecVol)
{
	uint32_t i;

		SYS->GPD_MFPL  = (SYS->GPD_MFPL & (~SYS_GPD_MFPL_PD3MFP_Msk) ) | SYS_GPD_MFPL_PD3MFP_MIC1_N;
		SYS->GPD_MFPL  = (SYS->GPD_MFPL & (~SYS_GPD_MFPL_PD2MFP_Msk) ) | SYS_GPD_MFPL_PD2MFP_MIC1_P;
		SYS_SetSharedPinType(SYS_PORT_D, 2, 0, 0);
		SYS_SetSharedPinType(SYS_PORT_D, 3, 0, 0);

		/* IIC Configure Step without PLL: */
		/* Add MCLK(256*Fs) in. */

		I2S_SET_INTERNAL_CODEC(I2S, 0x08, 0x1F);	// Mute headphone of Left channel
		I2S_SET_INTERNAL_CODEC(I2S, 0x09, 0x1F);	// Mute headphone of Right channel
		I2S_SET_INTERNAL_CODEC(I2S, 0x10, 0x0F);	//Mute the ADC Left channel volume
		I2S_SET_INTERNAL_CODEC(I2S, 0x11, 0x0F);	//Mute the ADC Right channel volume
		I2S_SET_INTERNAL_CODEC(I2S, 0x12, 0x0F);	//Mute the ADC Side tone volume

		I2S_SET_INTERNAL_CODEC(I2S, 0x02, 0xC0);	//Set CODEC slave

		I2S_SET_INTERNAL_CODEC(I2S, 0x01, 0x80);	//Digital Part Enable
		I2S_SET_INTERNAL_CODEC(I2S, 0x0F, 0xC0);	//Enable Analog Part
		I2S_SET_INTERNAL_CODEC(I2S, 0x0E, 0x06);	//ADC input select MIC1

		I2S_SET_INTERNAL_CODEC(I2S, 0x0B, 0xF3);	//Analog Part Enable
		I2S_SET_INTERNAL_CODEC(I2S, 0x0D, 0x31);	//Biasing enable
		I2S_SET_INTERNAL_CODEC(I2S, 0x0B, 0xE3);
		for (i=0; i < 15; i++)	//Delay 1.5s~2.5s
			CLK_SysTickDelay(100000);
		I2S_SET_INTERNAL_CODEC(I2S, 0x0A, 0x09);
		I2S_SET_INTERNAL_CODEC(I2S, 0x0B, 0xF0);
		I2S_SET_INTERNAL_CODEC(I2S, 0x00, 0xD0);	//ADC digital enabled
		CLK_SysTickDelay(100000);	//Delay 100mS

	if (i8RecVol <= 0)
	{
		i8RecVol = 15;	// Volume Mute
		I2S_SET_INTERNAL_CODEC(I2S, 0x10, i8RecVol);	//Mute the ADC Left channel volume and set Pre-Gain 0 dB
	}
	else
	{
		i8RecVol--;
		if (i8RecVol > 14)	i8RecVol = 14;	// from 0 dB, 1.6 dB, 3.2 dB, ... , 22.4 dB
		I2S_SET_INTERNAL_CODEC(I2S, 0x10, i8RecVol|0x10);	//Un-Mute the ADC Left channel volume and set Pre-Gain 20 dB
	}

		I2S_SET_INTERNAL_CODEC(I2S, 0x11, i8RecVol);	//Un-Mute the ADC Right channel volume
//		I2S_SET_INTERNAL_CODEC(I2S, 0x12, 0x00);	//Un-Mute the ADC Side tone volume

  /* If Fs is changed, please Mute Headphone First and soft reset digital part after MCLK is stable. */
}

void InternalCODEC_Setup(int8_t i8RecVol)
{
//		demo_LineIn(i8RecVol);
		demo_MIC0(i8RecVol);
//		demo_MIC1(i8RecVol);

//    printf("Internal CODEC init [OK]\n");
}

/*** (C) COPYRIGHT 2015 Nuvoton Technology Corp. ***/
